app/Controllers/subTareaController.php

public function eliminar($id)
{
    $modelo = new \App\Models\Subtarea();
    $tarea_id = $this->request->getPost('tarea_id');


    if ($modelo->delete($id)) {
---
DELETE FROM `subtarea`
WHERE `id` IN ('4')