app/Controllers/usuarioController.php

    public function editarView()
    {
        $session = session();
        $usuarioId = $session->get('id_usuario');

        try {
            $modelo = new Usuario();
            $usuario = $modelo->find($usuarioId);
---
SELECT *
FROM `usuario`
WHERE `usuario`.`id` = '18'

    public function autenticar()
    {
        $correo = $this->request->getPost('correo');
        $clave = $this->request->getPost('clave');

        try {
            $model = new Usuario();
            $usuario = $model->where('correo', $correo)->first();
---
SELECT *
FROM `usuario`
WHERE `correo` = 'augustoluceropollio@gmail.com'
 LIMIT 1