app/Models/colaboracion.php

     public function obtenerColaboradores($tarea_id)
    {
        return $this->select('colaboracion.*, usuario.nombre')
                ->join('usuario', 'usuario.id = colaboracion.usuario_id')
                ->where('colaboracion.tarea_id', $tarea_id)
                ->findAll();
---
SELECT `colaboracion`.*, `usuario`.`nombre`
FROM `colaboracion`
JOIN `usuario` ON `usuario`.`id` = `colaboracion`.`usuario_id`
WHERE `colaboracion`.`tarea_id` = '18'