app/Models/miembroSubtarea.php

SELECT *
FROM `miembro_subtarea`
---
    public function obtenerMiembrosSubTarea()
    {
        return $this->findAll();

SELECT `miembro_subtarea`.*, `usuario`.`nombre`, `usuario`.`correo`
FROM `miembro_subtarea`
JOIN `usuario` ON `usuario`.`id` = `miembro_subtarea`.`usuario_id`
WHERE `miembro_subtarea`.`subtarea_id` = '100'
---
    public function obtenerUsuariosConDatosPorSubtarea($subtarea_id)
{
    return $this->select('miembro_subtarea.*, usuario.nombre, usuario.correo')
                ->join('usuario', 'usuario.id = miembro_subtarea.usuario_id')
                ->where('miembro_subtarea.subtarea_id', $subtarea_id)
                ->findAll();