app/Models/subTarea.php

    public function obtenerSubTareas($id_Tarea)
{
    return $this->where('tarea_id', $id_Tarea)->findAll();
---
SELECT *
FROM `subtarea`
WHERE `tarea_id` = '20'

      public function cambiarEstado($id, $nuevoEstado)
    {
        return $this->update($id, ['estado' => $nuevoEstado]);
---
UPDATE `subtarea` SET `estado` = 'completada'
WHERE `subtarea`.`id` IN ('112')